Failed to merge overlapping solids
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId BooleanUnionFailed { get; }
  Visual Basic
Public Shared ReadOnly Property BooleanUnionFailed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ BooleanUnionFailed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MassFailures Class
  Autodesk.Revit.DB Namespace